#Выполнил работу Васькевич Юрий Андреевич
#Задача:
#Даны два целых числа. Выведите значение наибольшего из них.
a = int(input())
b = int(input())
if a > b:
    print(a)
else:
    print(b)
