"""Programming Taskbook
ЮФУ Электронный задачник по программированию
©  М. Э. Абрамян (Южный федеральный университет), 1998–2020
begin3 Даны стороны прямоугольника a и b.
Найти его площадь S = a·b и периметр P = 2·(a + b).
Tolokonnikov.A.M"""

a = int(input())
b = int(input())
S = a * b
P = 2 * (a + b)
print(S)
print(P)
