a = int(input()) # Напишите программу, которая выводит "Чет", если введенное целое число является четным, и "Нечет" в обратном случае. 
if (a%2>0):
    print("Нечет")
else:
    print("Чет")
