a = input() #Манхэттенский проект — кодовое название программы США по разработке ядерного оружия. В разработке участвовало рекордное количество ученых с мировым именем. Вот список наиболее известных из них: Энрико Ферми, Нильс Бор, Джон фон Нейман, Ричард Фейнман, Роберт Оппенгеймер, Ганс Бизе, Ханс Бете. Вам было поручено написать программу-пропуск, которая принимает на вход имя человека и выводит "Доступ разрешен", если имя присутствует в списке, представленном выше, или "Доступ запрещен" в обратном случае.
if a == "Энрико Ферми" or a == "Нильс Бор" or a == "Джон фон Нейман" or a == "Ричард Фейнман" or a == "Роберт Оппенгеймер" or a == "Ганс Бизе" or a == "Ханс Бете":
  print("Доступ разрешен")
else:
  print("Доступ запрещен")
