#Выполнил Кузнецов М. С. П2-18.
#Дана строка, состоящая из слов, разделенных пробелами.
#Определите, сколько в ней слов. Используйте для решения задачи метод count.
s = input()
print(s.count(' ') + 1)
