//https://stepik.org/lesson/13377/step/13?auth=login&unit=3571
/*Напишите программу для вычисления целочисленного логарифма по основанию 2. На вход программе в первой строке подается число T, далее следует T строк с тестами. Каждый тест состоит из одного целого положительного числа ai < 10^9, для каждого ai нужно вывести на отдельной строке такое наибольшее число p, что 2^p < ai.Гарантируется, что ai > 1.При решении задачи вы можете определять любые вспомогательные функции, если они вам нужны, более того рекомендуется вынести вычисление логарифма в отдельную функцию.
Ограничения: библиотеку cmath (и math.h) использовать запрещено.*/

#include <iostream>
using namespace std;
int log(int);
int main() 
{
    
    int n;
    cin >> n;
    while(n--) 
    {
        int k;
        cin >> k;
        cout << log(k) << endl;
    }
    return 0;
}
int log(int k) {
    int p = -1;
 
    do 
    {
        k >>= 1;
        ++p;
    } 
    while(k);
    return p;
}