#Найти расстояние между двумя точками с заданными координатами x1 и x2
#на числовой оси: |x2 − x1|.

x1 = int(input())
x2 = int(input())
print("x1: ", x1)
print("x2: ", x2)
print("Расстояние: ", abs(x2-x1))
