# Дано целое число в диапазоне 1–7.
#Вывести строку — название дня недели, соответствующее данному числу
#(1 — «понедельник», 2 — «вторник» и т. д.).
#Case1
a=int(input())
if a==1 :
    print ("понедельник")
elif a==2 :
    print ("вторник")
elif a==3 :
    print ("среда")
elif a==4 :
    print ("четверг")
elif a==5 :
    print ("пятница")
elif a==6 :
    print ("суббота")
else a==7 :
    print ("воскресение")    


# Дано целое число K.
#Вывести строку-описание оценки, соответствующей числу K
# (1 — «плохо», 2 — «неудовлетворительно», 3 — «удовлетворительно», 4 — «хорошо», 5 — «отлично»).
#Если K не лежит в диапазоне 1–5, то вывести строку «ошибка».
a=int(input())
if 1<a>6 :
     print ("ошибка")
elif a==1 :
    print ("плохо")
elif a==2 :
    print ("неудовлетворительно")
elif a==3 :
    print ("удовлетворительно")
elif a==4 :
    print ("хорошо")
elif a==5 :
    print ("отлично")
#
#
#
a=int(input())
if a==1 :
    print ("январь")
elif a==2 :
    print ("февраль")
elif a==3 :
    print ("март")
elif a==4 :
    print ("апрель")
elif a==5 :
    print ("май")
elif a==6 :
    print ("июнь")
elif a==7 :
    print ("июль")
elif a==8 :
    print ("август")
elif a==9 :
    print ("сентябрь")
elif a==10 :
    print ("октябрь")
elif a==11 :
    print ("ноябрь")
elif a==12 :
    print ("декабрь")
