#Выполнил Зайцев Н. Е. П2-18.
# Даны три целых числа: A, B, C. Проверить истинность высказывания:
#«Каждое из чисел A, B, C положительное»

a = int(input())
b = int(input())
c = int(input())

if a > 0 and b > 0 and b > 0:
    print("True")
else:
    print("False")
