#Выполнил Завадский Михаил П2-18.
#Дана сторона квадрата a. Найти его периметр P = 4*a.
a = int(input())
a = a * 4
print(a)
