#Выполнил Завадский Михаил П2-18.
#Дано целое число A.
#Проверить истинность высказывания: «Число A является положительным».
x = int(input())
x = x > 0
print(x)
