#Выполнил Завадский Михаил П2-18.
#Дана сторона квадрата a. Найти его площадь S = a^2.
a = int(input())
a = a * a
print(a)
