#Выполнил работу Яковлев Прокопий 
#Задача:
#Известный книжный магазин "Питонист" обратился к вам как к специалисту за помощью. От вас требуется написать программу, которая принимает на вход две строки: имя автора и название книги (в такой последовательности), а затем выводит небольшое рекламное сообщение от магазина.
name = input()
book = input()
print( name, '- автор бестселлера', book, '- выпустил новую книгу! Спешите приобрести ее в магазине Питонист!')
