#Выполнил работу Михайлов Данила Алексеевич
#Оформил задачу Пилипушко Андрей Сергеевич
#Дано целое число A.
#Проверить истинность высказывания: «Число A является положительным».
x = int(input("Введите число A: "))
res = x > 0
print(res)
