#Выполнил работу Михайлов Данила Алексеевич
#Оформил задачу Пилипушко Андрей Сергеевич
#Задача:
#Даны два целых числа. Выведите значение наименьшего из них.
a = int(input())
b = int(input())
if a < b:
    print(a)
else:
    print(b)
