import sqlite3

# Создание списка таблици
'''      Название                 Автор               Год      Цена   '''  
text = [('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Ася  ', 'Иван Тургенев  ','1858  ','650  '),
        ('Мертвые души  ', 'Николай Гоголь  ','1842  ','839  '),
        ('Хождение по мукам  ', 'Алексей Толстой  ','1922  ','999  '),
        ('Записки охотника  ', 'Иван Тургенев  ','1852  ','400  '),
        ('Война и Мир  ', 'Лев Толстой  ','1865  ','2239  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  '),
        ('Мастер и Маргарита  ', 'Михаил Булгаков  ','1929  ','1250  ')]

# Создание и запись списка в таблицу
conn = sqlite3.connect('LibTable')
curs = conn.cursor()

curs.execute("""CREATE TABLE Lib(
    Name TEXT,
    HP INTEGER,
    Year INTEGER,
    Price INTEGER)""")

curs.executemany("INSERT INTO Lib VALUES (?, ?, ?, ?)", text)

conn.commit()
