import sqlite3

# Создание списка таблици
'''      Название               Страна   Автор               Год      Цена   '''  
text = [('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250'),
        ('Мастер и Маргарита  ','Rus  ','Михаил Булгаков  ','  1929','  1250')]

# Создание и запись списка в таблицу
conn = sqlite3.connect('LibTable')
curs = conn.cursor()

curs.execute("""CREATE TABLE Lib(
    Name TEXT,
    Country TEXT,
    HP INTEGER,
    Year INTEGER,
    Price INTEGER)""")

curs.executemany("INSERT INTO Lib VALUES (?, ?, ?, ?, ?)", text)

conn.commit()
