#Задание выполнил Яковлев Прокопий Максимович
#Дана строка, состоящая из слов, разделенных пробелами.
#Определите, сколько в ней слов.
print(input().count(' ')+1)
