# Выполнил:Степаненко Кирилл Алексеевич
# Группа: П2-18
# https://pythontutor.ru/lessons/lists/problems/num_equal_pairs/

# Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу.
# Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.

a = [int(s) for s in input().split()]
counter = 0
for i in range(len(a)):
    for j in range(i + 1, len(a)):
        if a[i] == a[j]:
            counter += 1
print(counter)