import sqlite3

#----------------------------------
text = [(1,'Гарри Поттер и узник Азкабана','Джоан Роулинг','Фэнтези', 1999),
        (2,'Зеленая миля','Стивен Кинг','Ужасы',1996),
        (3,'Властелин Колец: Возвращения короля','Джон Р.Р. Толкин','Фэнтези', 1955),
        (4,'Черный дом','Стивен Кинг','Ужасы',2001)]

conn = sqlite3.connect('library')
curs = conn.cursor()
curs.execute("""CREATE TABLE "Книги" (
                "Код_книги"	INTEGER,
                "Название"	TEXT,
                "Автор"	TEXT,
                "Жанр"	TEXT,
                "Год_издания"	INTEGER) """)
curs.executemany("INSERT INTO Книги VALUES (?, ?, ?, ?, ?)", text)
conn.commit()
#----------------------------------
text = [(675,'Сидоров','Александр','Сергеевич',675),
        (456,'Прядко','Никита','Петрович',456),
        (533,'Романов','Николай','Александрович',533)]
        
conn = sqlite3.connect('library')
curs = conn.cursor()
curs.execute("""CREATE TABLE "Читатели" (
                "Код_читателя"	INTEGER,
                "Фамилия"	TEXT,
                "Имя"	TEXT,
                "Отчество"	TEXT,
                "№_читательского_билета" INTEGER) """)
curs.executemany("INSERT INTO Читатели VALUES (?, ?, ?, ?, ?)", text)
conn.commit()
#----------------------------------
text = [(675, 1, '25.03.21'),
        (456, 2, '03.10.21'),
        (533, 2, '25.03.21')]
        
conn = sqlite3.connect('library')
curs = conn.cursor()
curs.execute("""CREATE TABLE "Выдача" (
                "Код_читателя"	INTEGER,
                "Код_книги"	INTEGER,
                "Дата_выдачи"	TEXT) """)
curs.executemany("INSERT INTO Выдача VALUES (?, ?, ?)", text)
conn.commit()
#----------------------------------

'''
код
001, Гарри Поттер и узник Азкабана, Джоан Роулинг, Фэнтези, 1999
002, Зеленая миля, Стивен Кинг, Ужасы, 1996
003, Властелин Колец: Возвращения короля, Джон Р.Р. Толкин, Фэнтези, 1955
004, Черный дом, Стивен Кинг, Ужасы, 2001
'''

'''
675, Сидоров, Александр, Сергеевич, 000675
456, Прядко, Никита, Петрович, 000456
533, Романов, Николай, Александрович, 000533
'''

'''
675, 001, 25.03.21
456, 002, 03.10.21
533, 003, 14.12.21
'''
