# Выполнил Кузнецов М. С. П2-18.
# Дан список чисел. Определите, сколько в нем встречается различных чисел.

print(len(set(input().split())))
