#Алексей Зотов.Введение в Python (7-8 классы).
#https://stepik.org/lesson/243394/step/13?unit=215740
#Выполнили: Воронцов А.А. Бурлаев З.С Щепкин М.В П2-18

"""
Телефонная книга. Этап 3. Коле очень понравилась Ваша программа, однако он стал 
замечать, что иногда в его телефонную книгу попадают номера в некорректном формате. 
Чтобы не сохранять недействительные номера, он попросил Вас обрабатывать только номера, 
соответствующие критериям:
- номер должен начинаться либо с +7, либо с 8 и состоять из 11 цифр.
- блоки цифр могут разделяться пробелами или дефисами.
- вторая, третья и четвертая цифры могут помещаться в скобки.
Если программа встречает некорректный номер, она должна его проигнорировать. В обратном 
случае она должна привести номер к виду +7 (900) 800-70-60 и запомнить. Остальной 
функционал программы остается без изменений.
"""
