#Задача "Площадь прямоугольного треугольника".
#Напишите программу, которая считывает длины двух катетов
#в прямоугольном треугольнике и выводит его площадь.
#Каждое число записано в отдельной строке.
a = int(input())
b = int(input())
print(a * b / 2)
