МДК.01.02 "Прикладное программирование"
ЛЗ 9. Разработка программ со строками
Составитель: Гусятинер Л.Б., 25.04.2020, МГОТУ ККМТ, П1-17, П2-17

[1] Упражнения раздела 3.2.1
1) Упражнение 3.2. Что такое стандартный конструктор?

	Ответ: 
		Автоматически создаваемый конструктор, если конструктор не был объявлен в классе.

2) Упражнение 3.3. Назовите три способа инициализации объекта класса string.

	string s1 = "PK";
	string s2(s1);
	string s3("size");

3) Упражнение 3.4. Каковы значения переменных s и s2?
string s; 
int main() { 
	string s2;
}
	Ответ: 
		это пустые строки.

[1] Упражнения раздела 3.2.2
4) Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки. 
Измените программу так, чтобы она читала отдельные слова.

	#include <iostream>
	#include <string>

	using namespace std;

	int main(){
    		string str;
    		getline(cin, str);
    	return 0;
	}	

5) Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных 
в строковую переменную, когда используется функция getline().
	
	Ответ: 
		Функция getline() записывает весь ввод, включая пробелы.
	
[1] Упражнения раздела 3.2.4
6) Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они, 
а если нет, какая из них больше. Измените программу так, чтобы она указывала, имеют ли строки 
одинаковую длину, и если нет, то какая из них длинней.

	#include <iostream>
	#include <string>

	using namespace std;

	int main(){
    		string str1, str2;
    		cin >> str1 >> str2;
    		if (str1.size() == str2.size())
        		cout << "Строки равны";
    		else if (str1.size() > str2.size())
        		cout << "Первая строка больше";
    		else
        		cout << "Вторая строка больше";

    	return 0;
	}


7) Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода 
и соединять их в одну большую строку. Отобразите полученную строку. Измените программу так, чтобы 
отделить соседние введенные строки пробелами.
	
	#include <iostream>
	#include <string>

	using namespace std;

	int main(){
    		string str, result;
    		while (getline(cin, str)){
        		result += (str + ' ');
        		cout << "Результат: " << result;
    		}
    	return 0;
	}

8) Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?

string s;
cout << s[0] << endl;

	Ответ: 
		Программа выполнится, но ничего не выведет, так как строка пустая.
		Но если бы строка была не пуста, она бы вывела 0ую позицию.
	
9) Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации. 
Программа должна позволить ввести символьную строку, содержащую знаки пунктуации, 
и вывести ту же строку, но уже без знаков пунктуации.

	#include <iostream>
	#include <string>

	using namespace std;	

	int main(){
    		string str;
    		getline(cin, str);
		for (int i = 0; i != str.size(); ++i){
        		if (!ispunct(str[i]))
            		cout << str[i];
    		}
    	return 0;
	}	

10) (Гусятинер Л.Б.) Изменить программу упражнения 3.10. так, чтобы входные данные поступали из файла input.txt,
а результат записывался в файл output.txt

	#include <string>
	#include <fstream>

	using namespace std;

	int main(){
    		string str;
    		ifstream fin("input.txt");
    		ofstream fout("output.txt");
    		getline(f1, str);
    		for (int i = 0; i != str.size(); i++){
        		if (!ispunct(str[i]))
            		fout << str[i];
    		}

    	fin.close();
    	fout.close();
    	return 0;
	}