# Выполнил:Степаненко Кирилл Алексеевич
# Группа: П2-18

# Задание. Разработать программы по темам
# - input -print
# Функция input() в Python, ввод данных с клавиатура.

name = input("What is your name? ")

age = int(input("How old are you? "))

home = input("Where are you live? ")

print("This is",name)

print('Is ' + str(age))

print('She/He live in',home)