#Выполнил Кузнецов М. С. П2-18.
#Даны два целых числа. Выведите значение наименьшего из них.

a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
print('Наименьшим из двух чисел будет', min(a,b))