#Выполнил Кузнецов М. С. П2-18.
#Даны три целых числа. Выведите значение наименьшего из них.
a = int(input())
b = int(input())
c = int(input())
print(min(a,b,c))