#Дана сторона квадрата a. Найти его периметр P = 4·a.
a =  float(input())
p = 4 * a
print(p)
