#Выполнил Кузнецов М. С. П2-18.
#Дано положительное действительное число X. Выведите его дробную часть.
a = float(input())
print(a % 1)
