# Выполнил:Степаненко Кирилл
# Группа: П2-18

# Задача «Количество различных чисел»
# Условие. Дан список чисел. Определите, сколько в нем встречается различных чисел.

s = set(input().split())

print(len(s))

# print(len(set(input().split())))