"""
ЛЗ 9. Разработка программ со строками
Составитель: Гусятинер Л.Б., 25.04.2020, МГОТУ ККМТ, П1-17, П2-17
"""

"""
Упражнение 3.3. Назовите три способа инициализации объекта класса string.
"""

#
"""
Существует несколько способов инициализации объектов класса string. Наиболее часто встречаемые:

string s1; – пустая строка
string s2 (s1); - инициализация строки s2 как копии строки s1
string s3 ("value string"); - инициализация строки s3 как копии строкового литерала
string s4 (n, 'b') - инициализация строки s4 последовательностью из n символов b
"""
