#include <stdio.h>
#include <locale.h>
 struct tur {
 char f[20];
 char country[25];
 int CS;
 int ctur;
 int chtur;
 int pr;};
 main()
 {
     setlocale(0,"");

 struct tur t[20],temp;
 int n,i;
 printf("Введите кол-во туров: ");
 scanf("%d",&n);
     for (i=0; i<n;i++)
     {printf("Фамилия, страна, кол-во семьи, стоимость тура\n");
     scanf("%s%s%d%d%d%d", &t[i].f,&t[i].country,&t[i].CS,&t[i].ctur);}
     printf("\n");
     printf("_________________________________________________________\n");
     printf("    Фамилия|      Страна|  Кол-во семьи|   Стоимость тура|\n");
     printf("___________|____________|______________|_________________|\n");
             for (i=0; i<n;i++)
             {

             printf("%10s | %10s | %6d | %7d | %7d | %7d |\n", t[i].f,t[i].country,t[i].CS,t[i].ctur);
             printf("___________|____________|________|_________|_________|_________|\n");
              }
	 printf("\n");
	 printf("Расчёт Цены билета и добавление итого \n");
	 printf("\n");
	 printf("__________________________________________________________________________________\n");
     printf("    Фамилия|      Страна|  Кол-во семьи|   Стоимость тура|   Цена билета|    Итого|\n");
     printf("___________|____________|______________|_________________|______________|_________|\n");
  	       for (i=0; i<n;i++)
       		  {

      		    t[i].pr=(t[i].CS*t[i].ctur);
      		   printf("%10s | %10s | %6d | %7d | %7d | %7d |\n", t[i].f,t[i].country,t[i].CS,t[i].ctur,t[i].chtur,t[i].pr);
      		   printf("___________|____________|________|_________|_________|_________|_________|\n");
      	    }
  int j;
  for (i=0; i<n-1;i++)
    for (j=i+1;j<n;j++)
        if(t[i].ctur<t[j].ctur){temp=t[i];t[i]=t[j];t[j]=temp;}
     printf("\n");
 printf("Cортировка по стоимости\n");
 printf("\n");
	 printf("__________________________________________________________________________________\n");
     printf("    Фамилия|      Страна|  Кол-во семьи|   Стоимость тура|   Цена билета|    Итого|\n");
     printf("___________|____________|______________|_________________|______________|_________|\n");
 for (i=0; i<n;i++)
 {
 printf("%10s | %10s | %6d | %7d | %7d | %7d |\n", t[i].f,t[i].country,t[i].CS,t[i].ctur,t[i].chtur,t[i].pr);
 printf("___________|____________|________|_________|_________|_________|_________|\n");
  }
          for (i=0; i<n-1;i++)
            for (j=i+1;j<n;j++)
                if(strcmp(t[i].country)>strcmp(t[j].country)){temp=t[i];t[i]=t[j];t[j]=temp;}
     printf("Cортировка по стране\n");
     printf("\n");
	 printf("__________________________________________________________________________________\n");
     printf("    Фамилия|      Страна|  Кол-во семьи|   Стоимость тура|   Цена билета|    Итого|\n");
     printf("___________|____________|______________|_________________|______________|_________|\n");
     for (i=0; i<n;i++)
      {
      }
 return 0;
 }
