#include <stdio.h>
#include <locale.h>
 struct student {
 char fio[20];
 int year;
 char gr[10];
 int math;
 int fiz;
 int xim;
 float sr;};
 main()
 {
     setlocale(0,"");

 struct student st[20],temp;
 char strtemp[20];
 int n,i;
 printf("Введите количество студентов   ");
 scanf("%d",&n);
     for (i=0; i<n;i++)
     {printf("Фамилия, год рожд, группа, математика, физика, химия \n");
     scanf("%s%d%s%d%d%d", &st[i].fio,&st[i].year,&st[i].gr,&st[i].math,&st[i].fiz,&st[i].xim);}
     printf("\n");
     printf("________________________________________________________________\n");
     printf("    Фамилия|   Год рожд.|  Группа|   Мат-ка|   Физика|   Химия |\n");
     printf("___________|____________|________|_________|_________|_________|\n");
             for (i=0; i<n;i++)
             {

             printf("%10s | %10d | %6s | %7d | %7d | %7d |\n", st[i].fio,st[i].year,st[i].gr,st[i].math,st[i].fiz,st[i].xim);
             printf("___________|____________|________|_________|_________|_________|\n");
              }
 printf("\n");
 printf("Добавление средней оценки\n");
 printf("\n");
 printf("__________________________________________________________________________\n");
 printf("    Фамилия|   Год рожд.|  Группа|   Мат-ка|   Хизика|   Химия |  Ср.балл|\n");
 printf("___________|____________|________|_________|_________|_________|__________\n");
          for (i=0; i<n;i++)
         {

          st[i].sr=(st[i].math+st[i].fiz+st[i].xim)/3.0;
         printf("%10s | %10d | %6s | %7d | %7d | %7d | %7.2f |\n", st[i].fio,st[i].year,st[i].gr,st[i].math,st[i].fiz,st[i].xim,st[i].sr);
         printf("___________|____________|________|_________|_________|_________|_________|\n");
          }
  int j;
  for (i=0; i<n-1;i++)
    for (j=i+1;j<n;j++)
        if(st[i].sr<st[j].sr){temp=st[i];st[i]=st[j];st[j]=temp;}



     printf("\n");

 printf("Cортировка по среднему баллу\n");
 printf("\n");
 printf("__________________________________________________________________________\n");
 printf("    Фамилия|   Год рожд.|  Группа|   Мат-ка|   Хизика|   Химия |  Ср.балл|\n");
 printf("___________|____________|________|_________|_________|_________|__________\n");
 for (i=0; i<n;i++)
 {

  st[i].sr=(st[i].math+st[i].fiz+st[i].xim)/3.0;
 printf("%10s | %10d | %6s | %7d | %7d | %7d | %7.2f |\n", st[i].fio,st[i].year,st[i].gr,st[i].math,st[i].fiz,st[i].xim,st[i].sr);
 printf("___________|____________|________|_________|_________|_________|_________|\n");
  }
          for (i=0; i<n-1;i++)
            for (j=i+1;j<n;j++)
                if(strcmp(st[i].fio)>strcmp(st[j].fio)){temp=st[i];st[i]=st[j];st[j]=temp;}
     printf("Cортировка по фамилии\n");
     printf("\n");
     printf("__________________________________________________________________________\n");
     printf("    Фамилия|   Год рожд.|  Группа|   Мат-ка|   Хизика|   Химия |  Ср.балл|\n");
     printf("___________|____________|________|_________|_________|_________|__________\n");
     for (i=0; i<n;i++)
      {
     printf("%10s | %10d | %6s | %7d | %7d | %7d | %7.2f |\n", st[i].fio,st[i].year,st[i].gr,st[i].math,st[i].fiz,st[i].xim,st[i].sr);
     printf("___________|____________|________|_________|_________|_________|_________|\n");
      }
 return 0;
 }
