#include <stdio.h>
#include <locale.h>
struct TUR{ ;
char fio[20];
char country[20];
int chel;
int sttur;
int put;
};
int main()
{
setlocale(0, "");
struct TUR st[20], temp;
int n, i, j;
printf("Введите количество ");
scanf("%d", &n);
// ВВод структуры
for (i=0;i<n;i++)
{
    printf("Фамилия, Страна, Кол-во человек, Стоимость тура \n");
    scanf("%s%s%d%d", &st[i].fio, &st[i].country, &st[i].chel, &st[i].sttur);
}
printf("\n");
printf("______________________________________________________\n");
printf("    Фамилия|   Страна| Кол-во человек| Стоимость тура|\n");
printf("___________|_________|_______________|_______________|\n");
//Вывод структуры
for (i=0;i<n;i++)
{
    printf("%11s|%9s|%15d%|%15d|\n", st[i].fio, st[i].country, st[i].chel, st[i].sttur);
    printf("___________|_________|_______________|_______________|\n");
}
//добавление стоимости путёвки
printf("\n");
printf("Добавление стоимости путёвки");
printf("\n");
printf("_________________________________________________________________________\n");
printf("    Фамилия|   Страна| Кол-во человек| Стоимость тура| Стоимость путёвки|\n");
printf("___________|_________|_______________|_______________|__________________|\n");
//вычисление стоимости Путёвки и вывод новой структуры
for (i=0;i<n;i++)
{
    st[i].put=(st[i].chel*st[i].sttur);
    printf("%11s|%9s|%15d%|%15d|%18d|\n", st[i].fio, st[i].country, st[i].chel, st[i].sttur, st[i].put);
    printf("___________|_________|_______________|_______________|__________________|\n");
}
// Сортировка пузырьком по стоимости тура
for (i=0;i<n-1;i++)
for (j=i+1;j<n;j++)
if(st[i].sttur<st[j].sttur){temp=st[i];st[i]=st[j];st[j]=temp;}
printf("\n");
//Вывод отсортированой структуры по стоимости тура
printf("\n");
printf("Вывод отсортированой структуры по стоимости тура\n");
printf("_________________________________________________________________________\n");
printf("    Фамилия|   Страна| Кол-во человек| Стоимость тура| Стоимость путёвки|\n");
printf("___________|_________|_______________|_______________|__________________|\n");
for (i=0;i<n;i++)
{
    printf("%11s|%9s|%15d%|%15d|%18d|\n", st[i].fio, st[i].country, st[i].chel, st[i].sttur, st[i].put);
    printf("___________|_________|_______________|_______________|__________________|\n");
}
//Сортировка по стране
for (i=0;i<n-1;i++)
for (j=0;j<n;j++)
if(st[i].country<st[j].country){temp=st[i];st[i]=st[j];st[j]=temp;}
printf("\n");
//Вывод отсортированой структуры по стране
printf("\n");
printf("Вывод отсортированой структуры по стране\n");
printf("_________________________________________________________________________\n");
printf("    Фамилия|   Страна| Кол-во человек| Стоимость тура| Стоимость путёвки|\n");
printf("___________|_________|_______________|_______________|__________________|\n");
for (i=0;i<n;i++)
{
printf("%11s|%9s|%15d%|%15d|%18d|\n", st[i].fio, st[i].country, st[i].chel, st[i].sttur, st[i].put);
printf("___________|_________|_______________|_______________|__________________|\n");
}
// Сортировка пузырьком по стоимости тура
for (i=0;i<n-1;i++)
for (j=i+1;j<n;j++)
if(st[i].put<st[j].put){temp=st[i];st[i]=st[j];st[j]=temp;}
printf("\n");
//Вывод отсортированой структуры по стоимости путёвки
printf("\n");
printf("Вывод отсортированой структуры по стоимости путёвки\n");
printf("_________________________________________________________________________\n");
printf("    Фамилия|   Страна| Кол-во человек| Стоимость тура| Стоимость путёвки|\n");
printf("___________|_________|_______________|_______________|__________________|\n");
for (i=0;i<n;i++)
{
    printf("%11s|%9s|%15d%|%15d|%18d|\n", st[i].fio, st[i].country, st[i].chel, st[i].sttur, st[i].put);
    printf("___________|_________|_______________|_______________|__________________|\n");
}
}
 
 
