#Выполнил Кузнецов М. С. П2-18.
#Напишите программу, которая приветствует пользователя, выводя слово Hello,
#введенное имя и знаки препинания по образцу:
print("Hello, ", input("Представьтесь, пожалуйста.\n"), '!', sep = '')