#Выполнил Кузнецов М. С. П2-18.
#Напишите программу, которая считывает три числа и выводит их сумму.
#Каждое число записано в отдельной строке.
x = int(input("Введите первое число: "))
y = int(input("Введите второе число: "))
z = int(input("Введите третье число: "))
print('Сумма этих чисел равна', x + y + z)
