# Выполнил: Бурлаев З.С.
# Programming Taskbook
# ЮФУ Электронный задачник по программированию
# ©  М. Э. Абрамян (Южный федеральный университет), 1998–2020
# Дано целое число A.
# Boolean2 Проверить истинность высказывания: «Число A является нечетным».

print(int(input()) / 2 )
