#Выполнил Щепкин П2-18
#Импортирование библиотеки Matplotlib
import matplotlib.pyplot as plt
# Координаты точек по x
x = [1, 12, 18, 24, 30]
# Координаты точек у первого графика по оси y
y1 = [0, 6, 3, 12, 1]
# Координаты точек у второго графика по оси y
y2 = [0, 2, 9, 7, 18]
#Размер окна
plt.figure(figsize = (12, 5)) 
# Построение первого графика
plt.plot(x, y1, 'o-r', alpha = 0.7, label="1. График", lw = 1, mec ='b',mew = 2, ms = 5)
# Построение второго графика
plt.plot(x, y2, 'v-.g', label = "2. График", mec ='r', lw = 2, mew = 2, ms = 9)
plt.legend()
plt.grid(True)
#Отображение графиков
plt.show()
