#Выполнил Кузнецов М. С. П2-18.
#Напишите программу, которая считывает длины двух катетов в
#прямоугольном треугольнике и выводит его площадь.
#Каждое число записано в отдельной строке.
a = int(input("Введите длину одного катета: "))
b = int(input("Введите длину другого катета: "))
s = (a * b) / 2
print('Площадь треугольника равна', s)
