#Выполнил Зайцев Н. Е. П2-18.
# Дана сторона квадрата a. Найти его площадь S = a2

a = int(input())
a *= a
print(a)
