//Выполнил задание: Пилипушко Андрей П2-18
//Задание: 1.8 Введение в синтаксис C++, часть 2

#include <iostream>
using namespace std;

int main()
{
    int t, a, b;
    cin>>t;
    for(int i = 0; i < t; i++){
    cin >> a >> b;
    cout << a + b << endl;
    }

    return 0;
}
