#Pythontutor
#https://pythontutor.ru/lessons/sets/problems/number_of_unique/
#Выполнили: Воронцов А.А. Бурлаев З.С. Щепкин М.В. П2-18

"""
Дан список чисел. Определите, сколько в нем встречается различных чисел.
"""

a = input().split()
print (len(set(a)))
