#Выполнил Кузнецов М. С. П2-18.
#Дана сторона квадрата a. Найти его периметр P = 4*a.
x = int(input("Введите сторону квадрата: "))
a = x * 4
print("Периметр квадрата равен", a)
