#Выполнил Кузнецов М. С. П2-18.
#Дана сторона квадрата a. Найти его площадь S = a^2.
x = int(input("Введите сторону квадрата: "))
a = x * x
print("Площадь квадрата равна", a)
