#Выполнил Кузнецов М. С. П2-18.
#Дано целое число A.
#Проверить истинность высказывания: «Число A является нечетным».
x = int(input("Введите число A: "))
res = x % 2 == 0
print(res)
